src/Cases/Validation_Edge/Canopy_uniform/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue qPlant 0
    volScalarFieldValue Cd 0
    volScalarFieldValue LAD 0
    volScalarFieldValue Moisture 0
);

regions
(
    boxToCell
    {
        box (0 0 0) (288 144 7.5);
        fieldValues
        (
            volScalarFieldValue Cd 0.2
            volScalarFieldValue LAD 0.2
        );
    }
);


// ************************************************************************* //
